//کلمه defer یک کلیدواژه است که در پیش¬فرض Go گنجانده شده، اگر defer رو قبل از کالِ یک فانکشن بنویسیم،
//ابتدا تمام کال¬ها را اجرا میکند و وقتی از گیومه¬ی func main خارج شد تازه کال¬ای که defer دارد را اجرا میکند.
package main

import (
	"fmt"
)

func main() {
	//اول، «بار» را اجرا کرد بعد «فو» را ، چون فو یک دیفر داشت
	defer foo()
	bar()
	//  وقتی کامپیوتر کد را میخواند از این گیومه که خارج شد تازه میرود آن کالی که دیفر دارد را اجرا میکند
}

func foo() {
	fmt.Println("foo")
}

func bar() {
	fmt.Println("bar")
}
