//خارج از func main یک personal type معرفی میکنیم و در انتهای عبارت، کلید واژه¬ی struct که یک تایپ هم هست را مینویسیم
//بعد از آن گیومه میگذاریم و داخلِ گیومه¬ی struct، valueهای متعددی از typeهای مختلف را تحت آن personal type معرفی میکنیم.
//بدین صورت که اول value  را مینویسیم و در همان سطر با فاصله typeاش را مینویسیم.
//سپس در قسمت func main یک متغیر کلی¬تر بوسیله := معرفی میکنیم
//و بعد از := اسم personal type  (که نامگذاری اش دست خودمان بود) را مینویسیم،
//سپس داخل گیومه در هر سطر  بوسیله دونقطه «:» (بین متغیر و مقدار) به هر متغیری یک مقدار معرفی میکنیم  و انتهای هر جفت یک کاما میگذاریم.
//برای پرینت با گذاشتن یک نقطه «.» بعد از متغیر کلی¬تر (variable) و نوشتن زیرمتغیر بعد از نقطه ، به اطلاعات آن متغیر دسترسی پیدا میکنیم.
//در واقع اتفاقی که میوفتد این است که ساختارِ typeهایِ personal type را در متغیرهای متعددی کپی پیست میکنیم.
//نکته1: متغیر کاملا تکراری در struct ممنوع است.
//نکته2: دو متغیر با یک تایپ را میتوان در یک سطر بوسیله¬ی کاما بین آندو معرفی کرد
//چه در گیومه¬ی struct چه در هر جای دیگه مثل var یا... مثال: var x,y int
package main

import (
	"fmt"
)

type person struct {
	first string
	last  string
	age   int
}

func main() {
	p1 := person{
		first: "James",
		last:  "Bond",
		age:   32,
	}

	p2 := person{
		first: "Miss",
		last:  "Moneypenny",
		age:   27,
	}

	fmt.Println(p1)
	fmt.Println(p2)

	fmt.Println(p1.first, p1.last, p1.age)
	fmt.Println(p2.first, p2.last, p2.age)
}
