
#! مثال آبجکت‌های غیر قابل تغییر (Immutable Objects):
#! اعداد (int):

x = 10
print(id(x))  # چاپ آدرس حافظه x

x = x + 1
print(id(x))  # چاپ آدرس حافظه جدید x

# مقدار x تغییر کرده، ولی آدرس حافظه متفاوت است

#?_________________________________________________________________________

#! رشته‌ها (str):

s = "hello"
print(id(s))  # چاپ آدرس حافظه s

s = s + " world"
print(id(s))  # چاپ آدرس حافظه جدید s

# مقدار s تغییر کرده، ولی آدرس حافظه متفاوت است

#?_________________________________________________________________________

#! تاپل‌ها (tuple):

t = (1, 2, 3)
print(id(t))  # چاپ آدرس حافظه t

t = t + (4,)
print(id(t))  # چاپ آدرس حافظه جدید t

# مقدار t تغییر کرده، ولی آدرس حافظه متفاوت است

#?_________________________________________________________________________

#! مثال آبجکت‌های قابل تغییر (Mutable Objects):
#! لیست‌ها (list):

l = [1, 2, 3]
print(id(l))  # چاپ آدرس حافظه l

l.append(4)
print(id(l))  # آدرس حافظه l همان آدرس قبلی است

# مقدار l تغییر کرده، ولی آدرس حافظه همان است

#?_________________________________________________________________________

#! دیکشنری‌ها (dict):

d = {'a': 1, 'b': 2}
print(id(d))  # چاپ آدرس حافظه d

d['c'] = 3
print(id(d))  # آدرس حافظه d همان آدرس قبلی است

# مقدار d تغییر کرده، ولی آدرس حافظه همان است

#?_________________________________________________________________________

#! مجموعه‌ها (set):

s = {1, 2, 3}
print(id(s))  # چاپ آدرس حافظه s

s.add(4)
print(id(s))  # آدرس حافظه s همان آدرس قبلی است

# مقدار s تغییر کرده، ولی آدرس حافظه همان است