<?php
$title='درج آگهی در سایت قیمت های ارزلایو';
?>
<div class="row">
	<div class="col12">
		<table id="ads" class="tools">
			<tr><th colspan=5>تبلیغ در ارزلایو</th></tr>
			<tr><td colspan=5 class="fa" width="50%">
				در صورت تمایل برای درج آگهی لطفاً پس از مطالعه دقیق تمام مطالب و شرایط موجود در صفحه، به یکی از 2 شیوه زیر اقدام فرمایید :
				<ul>
				<li>درخواست خود را از طریق صفحه تماس با ما ارسال نمایید تا اعضای تیم بازرگانی در اسرع وقت با شما تماس حاصل نمایند.
				<li>برای آگاهی دقیق تر از شرایط و چگونگی همکاری و پاسخ گویی به سئوالات خود، با واحد بازرگانی به شماره تلفن های 88307981 و 88834685 تماس حاصل کنید.
				</ul>
			</td></tr>

		<tr><th colspan=5>تعرفه درج تبلیغ</th></tr>
		<tr><td colspan=5 class="fa">
		<div class="notes">
			<ul>
			<li>برای محاسبه هزینه های درج آگهی می توانید از ابزار زیر استفاده کنید . برای این منظور مبلغی که قصد دارید برای درج آگهی خود صرف نمایید را (حداقل یکصد هزار تومان) در باکس نخست وارد کنید و سپس موضوع آگهی خود را از باکس دوم گزینش نمایید تا این ابزار تعداد تقریبی نمایش آگهی شما (باکس سوم) و تعداد دقیق کلیک های دریافتی (باکس چهارم) را برای مبلغ مدنظرتان محاسبه و اعلام نماید.
			<li>کلیه تخفیفات قابل ارائه در این اسکریپت (ابزار) پیش بینی و لحاظ شده است که 2 نوع می باشند :</li>
			<ol>
			<li>تخفیف حجمی : به این معنا که هر چه مبلغ بیشتری سفارش داده شود تخفیف بیشتری نیز ارائه خواهد شد به طور مثال در سفارش دویست هزار تومانی 3 % و در سفارش یک و نیم میلیون تومانی 18 % تخفیف ارائه می گردد.
			<li>	تخفیف موضوعی : بدبن معنا که هزینه هر کلیک به تناسب موضوع آگهی، متغییر می باشد. به این منظور باکس دوم در ابزار محاسباتی فوق تعبیه شده است.
			لذا موکدا اعلام می گردد که هیچ گونه تخفیفی خارج از  2 نوع فوق الذکر قابل ارائه نمی باشد.
			</ol>
			<li>	حداقل مبلغ سفارش آگهی صد هزار تومان می باشد.
			<li>	در آگهی هایی که به دلیل عدم ارتباط موضوعی یا خاص بودن مورد آگهی شده، کلیک بسیار کمی دریافت می کنند امکان تمدید به روش کلیک بیس مقدور نمی باشد.
			<li>	طرح آگهی (با رعایت الزامات و استانداردهای فنی قید شده در بند دوم ) باید از سوی آگهی دهنده ارائه شود. در صورت عدم امکان ارائه طرح، ارزلایو این سرویس را نیز ارائه می دهد. هزینه هر بنر 75 هزار تومان می باشد که ضمیمه هزینه درج آگهی خواهد شد.
			</ul>
		</div></td></tr>
		<tr><td>مبلغ کل آگهی <sup class="currency_disp">ریال</sup></td><td>موضوع آگهی</td><td>تعداد نمایش</td><td>تعداد کلیک</td><td>میزان تخفیف محاسبه شده</td></tr>
		<tr>
			<td width="15%"><input value="5,000,000" size="12" id="money"></td>
			<td width="15%"><select style="font-size:12px;font-family:tahoma" dir="rtl" id="category"><option value="1000000">انتخاب نمایید</option><optgroup style="font-family:tahoma" label="اطلاع رسانی"><option value="1">اقتصادی</option><option value="1.33">عمومی</option></optgroup><optgroup style="font-family:tahoma" label="خدمات"><option value="1.22">تورهای مسافرتی</option><option value="1.22">خدمات مخابراتی</option><option value="1.22">عمومی</option><option value="1.83">غیر عمومی</option></optgroup><optgroup style="font-family:tahoma" label="خدمات مالی"><option value="1.63">صرافی ها</option><option value="1.55">کارت اعتباری</option></optgroup><optgroup style="font-family:tahoma" label="محصولات"><option value="1.42">فروشگاه اینترنتی</option><option value="1.43">تبلیغ محصولات</option></optgroup></select></td>
			<td width="15%"><input readonly="readonly" disabled="disabled" size="10" id="views"></td>
			<td width="15%"><input readonly="readonly" disabled="disabled" size="10" id="clicks"></td>
			<td><input readonly="readonly" disabled="disabled" size="4" id="discount"><br><br></td></tr>


		<tr><th colspan=5>استانداردهای فنی</th></tr>
		<tr><td colspan=5 class="fa">
			<div class="notes"><ul>
			<li>نمایش آگهی‌ها تنها به صورت تصویر ثابت امکان‌پذیر می باشد.
			<li>	آگهی ها به طور متوالی، در بازه های زمانی ثابت و با ترتیب ثابت نمایش داده می شوند. کلیه فرآیند چینش و نمایش آنها دارای قاعده یکسان و برابر می باشد و بدون دخالت نیروی انسانی به انجام می رسد.
			<li>	فرمت فایل های آگهی باید صرفا یکی از 3 گزینه PNG ، JPEG ، GIF باشند.
			<li>	ابعاد فایل آگهی برای بلوک A باید 650x99 پیکسل و برای بلوک B باید 310x99 پیکسل باشند.
			<li>	حجم فایل آگهی برای بلوک A تا 15 کیلوبایت و برای بلوک B تا 8 کیلو بایت پذیرفته می شود.
			</ul><br></div>
		</td></tr>


		<tr><th colspan=5>قوانین و شرایط پذیرش آگهی</th></tr>
		<tr><td colspan=5 class="fa">
		<div class="notes"><ul>
		<li>پس از بررسی، تنها آگهی‌هایی که در چهارچوب قوانین بین‌المللی و داخلی باشند پذیرفته می شوند.
		<li>ماهیت سایت از هنگام سفارش آگهی نباید تغییر کند و در صورت ایجاد هر گونه تغییر خارج از چهارچوب قوانین، وب سایت از ادامه نمایش آگهی خودداری می‌نماید.
		<li>وب سایت ارزلایو، مسئولیتی در قبال محتوای آگهی درج شده از قبیل: متن، تصویر و غیره ندارد.
		<li>در صورت صدور دستور قضایی یا اخطار توسط نهادهای مربوطه مبنی بر حذف آگهی، ارزلایو خود را موظف به اجرا می‌داند و در صورت بروز خسارت مسئولیتی متوجه ارزلایو نخواهد بود.
		<li>لطفاً قوانین، شرایط و استانداردهای درج آگهی را کامل و دقیق مطالعه نمایید چرا که پرداخت وجه آگهی به معنی پذیرش تمامی شرایط از سوی سفارش دهنده آگهی می‌باشد و در صورتی که بموجب عدم رعایت موارد فوق، آگهی حذف یا معلق شود وب سایت در قبال عودت وجه هیچگونه مسئولیتی نخواهد داشت.
		<li>گزارش تعداد کلیک ها و سایر آمار و مستندات صرفا از سوی ارزلایو و از طریق سرویس گوگل آنالیتیک صورت می پذیرد بدین شکل که در ابتدای سفارش آگهی، یک نشانی ایمیل از آگهی دهنده دریافت می شود و از آن پس گزارش تعداد کلیک ها و سایر آمار مرتبط به ایمیل مذکور به طور روزانه ارسال می گردد. شایان ذکر است که کلیه این فرآیند توسط سرویس های گوگل صورت می پذیرد و سایت ارزلایو امکان هیچ نوع دخل و تصرفی در آنها را نخواهد داشت.
		<li>لازم به ذکر است که صرفا گزارش گوگل آنالیتیک تنظیم شده توسط سایت ارزلایو ملاک محاسبات می باشد و گزارش سایر سرویس های مشابه یا سرور آگهی دهنده یا هر نوع اسکریپت و شمارش گر از سوی آگهی دهندگان محترم پذیرفته نیست و در صورت بروز اختلاف بین آمار ارزلایو و آگهی دهنده، تنها آمار سایت ارزلایو معیار محاسبات خواهد بود.
		</ul></div><br></td></tr>

		<tr><th colspan=5>نکات الزامی تبلیغات کلیکی (کلیک بیس )</th></tr>
		<tr><td colspan=5 class="fa">
			<div class="notes"><ul>
			<li>در حال حاضر روش تبلیغ کلیک بیس یا کلیکی به عنوان موثرترین و کاراترین شیوه تبلیغ اینترنتی در بین سایر روش های رایج در سطح جهان شناخته می شود در این روش شما فقط هزینه تعداد کاربرانی که با کلیک روی آگهی شما به سایت شما وارد می شوند (ارجاع داده می شوند) را می پردازید.
			<li>امکان قید شماره تلفن و یا آدرس نیز مقدور نمی باشد.
			</ul></div></td></tr>


		</table>
	</div>
	<div class="clear"></div>
</div>