# ساده‌ترین شکل range
# تولید اعداد از ۰ تا ۴
for i in range(5):
    print(i)
خروجی:
0
1
2
3
4
__________________________________________________________________________

# مشخص کردن شروع و پایان
# تولید اعداد از ۱ تا ۴
for i in range(1, 5):
    print(i)
خروجی:
1
2
3
4
__________________________________________________________________________

# استفاده از گام
# تولید اعداد از ۰ تا ۸ با گام ۲
for i in range(0, 10, 2):
    print(i)
خروجی:
0
2
4
6
8
__________________________________________________________________________

# تولید اعداد منفی
# تولید اعداد از ۱۰ تا ۱ با گام -۲
for i in range(10, 0, -2):
    print(i)
خروجی:
10
8
6
4
2
__________________________________________________________________________

# ویژگی‌های range
# تولید تنبل (Lazy Evaluation): range اعداد را به صورت تنبل تولید می‌کند، یعنی همه اعداد را یک‌باره در حافظه ذخیره نمی‌کند و فقط وقتی به آن‌ها نیاز باشد، تولید می‌شوند. این ویژگی باعث می‌شود range برای کار با دنباله‌های بزرگ بسیار کارآمد باشد.
# نوع داده خاص: range یک نوع داده خاص است که از نوع range است.
# غیرقابل تغییر (Immutable): مقادیر داخل یک range پس از ایجاد تغییر نمی‌کنند.
# بررسی نوع داده range

r = range(5)
print(type(r))  # خروجی: <class 'range'>

__________________________________________________________________________

# تبدیل range به لیست
# اگر نیاز دارید که range را به یک لیست تبدیل کنید، می‌توانید از تابع list() استفاده کنید:

r = range(5)
list_r = list(r)
print(list_r)  # خروجی: [0, 1, 2, 3, 4]

__________________________________________________________________________

