//بوسیله : (colon دونقطه) داخل کروشه[] میتوان دستور داد از ابتدا تا انتهای یک جایگاه را پرینت کند،
//که ابتدا شامل هست اما انتها شامل نیست و اگر بخواهیم آخرین مقدار هم پرینت کند فقط باید ابتدا را بدهیم و انتها را خالی بگذاریم.
//اگر هم ابتدا یعنی قبل از دو نقطه را خالی بگذاریم بطور دیفالت  از ابتدا را میگیرد. به این صورت:
//fmt.Println(x [1:]) از جایگاه یک تا انتها
//fmt.Println(x [1:3])  از جایگاه یک تا جایگاه سه که خود جایگاه سه شامل نیست.
// Yoones
package main

import "fmt"

func main() {

	x := []int{11, 12, 13, 14, 15}

	fmt.Println(x[1:])
	fmt.Println(x[1:3])

}
