// Assigning a func to a variable اختصاص یک تابع به یک متغیر
//همانطور که مثلا int و string یک تایپ هستند و ما میتوانیم آنها را به یک متغیر اختصاص دهیم ،
//چون func هم یک تایپ است با := میتوانیم آنرا به یک متغیر اختصاص دهیم. با این ساختار:
//
//f := func() {} f()
//
//همانطور که متوجه شدی، اجرا (execute) کردن یک func یا توسط کال است که جدا از func و در گیومه ی func main است،
//و یا اگر بی نام است در آخر فانکشن با پرانتزی که برای آرگومان ها است باید اجرا شود ،
//حال اگر فانکشن بی نامی را به متغیری مثل f معرفی کنیم، باز هم برای اجرا در آخر عبارت فانکشن آنرا با نام همان متغیر (مثلا f) کال و اجرا میکنیم.
//اگر هم به متغیر معرفی نکنیم فقط پرانتز خالی میاید.
package main

import (
	"fmt"
)

func main() {
	fmt.Println("Hello, playground")

	f := func() {
		fmt.Println("my first func expression")
	}
	f()

	g := func(x int) {
		fmt.Println("the year big brother started watching:", x)
	}
	g(1984)
}
